## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,651 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.load-balancer.azurerm_lb.load-balancer[0] will be created
+  + resource "azurerm_lb" "load-balancer" {
+      + id                   = (known after apply)
+      + location             = "canadacentral"
+      + name                 = "load-balancer-core-qa-cace"
+      + private_ip_address   = (known after apply)
+      + private_ip_addresses = (known after apply)
+      + public_ip_address_id = (known after apply)
+      + resource_group_name  = "rg-qa-app-cace"
+      + sku                  = "Standard"
+      + sku_tier             = "Regional"
+      + subnet_id            = (known after apply)
+
+      + frontend_ip_configuration {
+          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
+          + id                                                 = (known after apply)
+          + inbound_nat_rules                                  = (known after apply)
+          + load_balancer_rules                                = (known after apply)
+          + name                                               = "publicIP"
+          + outbound_rules                                     = (known after apply)
+          + private_ip_address                                 = (known after apply)
+          + private_ip_address_allocation                      = "Dynamic"
+          + private_ip_address_version                         = (known after apply)
+          + public_ip_address_id                               = (known after apply)
+          + public_ip_prefix_id                                = (known after apply)
+        }
+
+      + timeouts {
+          + create = "60m"
+          + delete = "60m"
+          + read   = "5m"
+          + update = "60m"
+        }
+    }
+
+  # module.load-balancer.azurerm_lb_backend_address_pool.load-balancer[0] will be created
+  + resource "azurerm_lb_backend_address_pool" "load-balancer" {
+      + backend_ip_configurations = (known after apply)
+      + id                        = (known after apply)
+      + inbound_nat_rules         = (known after apply)
+      + load_balancing_rules      = (known after apply)
+      + loadbalancer_id           = (known after apply)
+      + name                      = "be-pool-core-qa-cace"
+      + outbound_rules            = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_lb_nat_rule.load-balancer[0] will be created
+  + resource "azurerm_lb_nat_rule" "load-balancer" {
+      + backend_ip_configuration_id    = (known after apply)
+      + backend_port                   = 80
+      + enable_floating_ip             = (known after apply)
+      + enable_tcp_reset               = (known after apply)
+      + floating_ip_enabled            = (known after apply)
+      + frontend_ip_configuration_id   = (known after apply)
+      + frontend_ip_configuration_name = "publicIP"
+      + frontend_port                  = 50001
+      + id                             = (known after apply)
+      + idle_timeout_in_minutes        = 4
+      + loadbalancer_id                = (known after apply)
+      + name                           = "VM-lb-nat-rule0"
+      + protocol                       = "Tcp"
+      + resource_group_name            = "rg-qa-app-cace"
+      + tcp_reset_enabled              = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_lb_nat_rule.load-balancer[1] will be created
+  + resource "azurerm_lb_nat_rule" "load-balancer" {
+      + backend_ip_configuration_id    = (known after apply)
+      + backend_port                   = 22
+      + enable_floating_ip             = (known after apply)
+      + enable_tcp_reset               = (known after apply)
+      + floating_ip_enabled            = (known after apply)
+      + frontend_ip_configuration_id   = (known after apply)
+      + frontend_ip_configuration_name = "publicIP"
+      + frontend_port                  = 50002
+      + id                             = (known after apply)
+      + idle_timeout_in_minutes        = 4
+      + loadbalancer_id                = (known after apply)
+      + name                           = "VM-lb-nat-rule1"
+      + protocol                       = "Tcp"
+      + resource_group_name            = "rg-qa-app-cace"
+      + tcp_reset_enabled              = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_lb_probe.load-balancer[0] will be created
+  + resource "azurerm_lb_probe" "load-balancer" {
+      + id                  = (known after apply)
+      + interval_in_seconds = 5
+      + load_balancer_rules = (known after apply)
+      + loadbalancer_id     = (known after apply)
+      + name                = "http"
+      + number_of_probes    = 2
+      + port                = 80
+      + probe_threshold     = 1
+      + protocol            = "Tcp"
+        # (1 unchanged attribute hidden)
+    }
+
+  # module.load-balancer.azurerm_lb_probe.load-balancer[1] will be created
+  + resource "azurerm_lb_probe" "load-balancer" {
+      + id                  = (known after apply)
+      + interval_in_seconds = 5
+      + load_balancer_rules = (known after apply)
+      + loadbalancer_id     = (known after apply)
+      + name                = "http2"
+      + number_of_probes    = 2
+      + port                = 1443
+      + probe_threshold     = 1
+      + protocol            = "Http"
+      + request_path        = "/"
+    }
+
+  # module.load-balancer.azurerm_lb_rule.load-balancer[0] will be created
+  + resource "azurerm_lb_rule" "load-balancer" {
+      + backend_address_pool_ids       = (known after apply)
+      + backend_port                   = 80
+      + disable_outbound_snat          = false
+      + enable_floating_ip             = (known after apply)
+      + enable_tcp_reset               = (known after apply)
+      + floating_ip_enabled            = false
+      + frontend_ip_configuration_id   = (known after apply)
+      + frontend_ip_configuration_name = "publicIP"
+      + frontend_port                  = 80
+      + id                             = (known after apply)
+      + idle_timeout_in_minutes        = 10
+      + load_distribution              = "Default"
+      + loadbalancer_id                = (known after apply)
+      + name                           = "http"
+      + probe_id                       = (known after apply)
+      + protocol                       = "Tcp"
+      + tcp_reset_enabled              = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_lb_rule.load-balancer[1] will be created
+  + resource "azurerm_lb_rule" "load-balancer" {
+      + backend_address_pool_ids       = (known after apply)
+      + backend_port                   = 443
+      + disable_outbound_snat          = false
+      + enable_floating_ip             = (known after apply)
+      + enable_tcp_reset               = (known after apply)
+      + floating_ip_enabled            = false
+      + frontend_ip_configuration_id   = (known after apply)
+      + frontend_ip_configuration_name = "publicIP"
+      + frontend_port                  = 443
+      + id                             = (known after apply)
+      + idle_timeout_in_minutes        = 10
+      + load_distribution              = "Default"
+      + loadbalancer_id                = (known after apply)
+      + name                           = "https"
+      + probe_id                       = (known after apply)
+      + protocol                       = "Tcp"
+      + tcp_reset_enabled              = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_network_interface_backend_address_pool_association.default[0] will be created
+  + resource "azurerm_network_interface_backend_address_pool_association" "default" {
+      + backend_address_pool_id = (known after apply)
+      + id                      = (known after apply)
+      + ip_configuration_name   = "app-test-ip-config-1"
+      + network_interface_id    = (known after apply)
+    }
+
+  # module.load-balancer.azurerm_public_ip.default[0] will be created
+  + resource "azurerm_public_ip" "default" {
+      + allocation_method       = "Static"
+      + ddos_protection_mode    = "VirtualNetworkInherited"
+      + fqdn                    = (known after apply)
+      + id                      = (known after apply)
+      + idle_timeout_in_minutes = 10
+      + ip_address              = (known after apply)
+      + ip_version              = "IPv4"
+      + location                = "canadacentral"
+      + name                    = "pip-core-qa-cace-1"
+      + resource_group_name     = "rg-qa-app-cace"
+      + sku                     = "Standard"
+      + sku_tier                = "Regional"
+      + tags                    = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "qa"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-vnet"
+        }
+        # (1 unchanged attribute hidden)
+
+      + timeouts {
+          + create = "60m"
+          + delete = "60m"
+          + read   = "5m"
+          + update = "60m"
+        }
+    }
+
+  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = 1
+      + id                              = (known after apply
```
See the full diff from https://github.com/terraform-az-modules/terraform-azurerm-load-balancer/actions/runs/19717149065

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azurerm-load-balancer/actions/runs/19717149065)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->